Update lecture_03_robotics_iot_big_data.md
